#include <stdio.h>

main(){

	char moji[12] = {97,42,98,45,99,100,47,101,43,102,103};
	int i,j;
	int back = 0, back2;
	int symbol_num = 0, alpha_num = 0, asta_num = 0;
	int save;

	printf("%s(初期状態)\n-------------------------\n",moji);/*初期状態*/

/*---------------R1:ASCIIコード(10進数)が97以下(記号)なら右に寄せる↓---------------*/

	for(i = 0; i < 10; i++){ /*全ての文字列を調べる*/
		if(moji[i] < 97){ /*記号を判定*/

			/*文字入れ替え*/
			save = moji[i];
			moji[i] = moji[i+1];
			moji[i+1] = save;

			printf("%s\n",moji);

		}
	

		if(i == 9 && symbol_num < 3){ /*記号が右に全て寄せ終わるまで初期化*/
		
			i = 0; /*初期化*/
			symbol_num++; /*右に寄った記号の数を数える*/
		
		}
	}
	
/*---------------R1:ASCIIコード(10進数)が97以下(記号)なら右に寄せる↑---------------*/

	symbol_num = 0; /*初期化*/
	printf("----------------ここまでR1------------------------\n");


/*---------R2:R1を適応した後、アルファベットを最後尾から左に寄せる↓-----------*/

	for(i = 6; i > back; i--){ /*アルファベットの部分を調べる*/
	
		/*文字入れ替え*/
		save = moji[i];
		moji[i] = moji[i-1];
		moji[i-1] = save;

		printf("%s\n",moji);

		back2 = back + 1; /*戻る場所を1つ右にずらす*/

		if(i == back2 && alpha_num < 6){ /*アルファベットが降順に全て並べ替えるまで初期化*/
		
			i = 7; /*初期化*/
			back++;
			alpha_num++; /*左に寄ったアルファベットの数を数える*/
		
		}

	}


/*---------R2:R1を適応した後、アルファベットを最後尾から左に寄せる↑-----------*/

	printf("----------------ここまでR2------------------------\n");

/*----------R3:R2を適応した後、ASCIIコード(10進数)が97以下(記号)の数字を小さい順に並べる↓-----------*/

		for(i = 7; i < 10; i++){ /*記号の部分を調べる*/
			if(moji[i] > moji[i+1]){ /*左の記号が右より大きかったら*/

				/*文字入れ替え*/
				save = moji[i];
				moji[i] = moji[i+1];
				moji[i+1] = save;

				printf("%s\n",moji);

			}
	
			if(i == 9 && symbol_num < 3){ /*記号が全て小さい順に並び替えるまで初期化*/
		
				i = 7; /*初期化*/
				symbol_num++; /*小さい順に並んだ記号の数を数える*/
		
			}
		}

/*----------R3:R2を適応した後、ASCIIコード(10進数)が97以下(記号)の数字を小さい順に並べる↑-----------*/

	printf("----------------ここまでR3------------------------\n");

/*----------R4:R3を適応した後、アスタリスクを最後から二番目にする↓----------*/

			for(i = 7; i < 9; i++){ /*記号の部分を調べる*/
				if(moji[i] == 42){ /*もしアスタリスクだったら*/

						/*文字入れ替え*/
						save = moji[i];
						moji[i] = moji[i+1];
						moji[i+1] = save;

						printf("%s\n",moji);

				}
	

				if(i == 9 && symbol_num < 3){ /*アスタリスクが右から二番目になるまで初期化*/
		
					i = 7; /*初期化*/
					symbol_num++; /*アスタリスクが右に動いた回数を数える*/

				}
			}

/*----------R4:R3を適応した後、アスタリスクを最後から二番目にする↑----------*/

	printf("----------------ここまでR4------------------------\n");
	printf("\n結果：%s\n終了\n\n",moji);
}