#include<stdio.h>
#include<string.h>

#define WORD 11


main(){
	char working[][WORD] = { 'a', '*', 'b', '-', 'c', 'd', '/', 'e', '+', 'f', 'g' };//初期状態
	//char working[][WORD] = { 'd', '+', '-', 'b', 'e', 'a', '/', 'c', '*', 'f', 'g' };//初期状態

	char goal[][WORD] = { 'g', 'f', 'e', 'd', 'c', 'b', 'a', '+', '-', '*', '/' };//ゴール状態

	char s_1[12] = { 0 };
	char s_2[12] = { 0 };
	char s_3 = 0;
	char s_4 = 0;
	char s_5 = 0;
	//ループ用変数
	int w = 0;
	int c_1 = 0;
	int c_2 = 0;

		//文字を右端に寄せ、記号と文字を分ける(R1)-------------------------------------------------------------------------------
		for (c_1 = 0; c_1 <= WORD; c_1++){
			if (working[0][c_1 + 1] > working[0][c_1]){//文字コードの大きいものがある場合入れ替える
				s_3 = working[0][c_1 + 1];
				working[0][c_1 + 1] = working[0][c_1];
				working[0][c_1] = s_3;
			}
			if (c_1 == 11){
				if (working[0][7] < 50 && working[0][8] < 50 && working[0][9] < 50 && working[0][10] < 50){
					break;//記号が右に寄ったらbreak
				}
				c_1 = 0;
				printf("------------------------\n");
			}
			printf("R1[%d]=%c\n", c_1, working[0][c_1]);
		}
		for (int i = 0; i <= 10; i++){
			printf("R1での最終的な状態(WM)[%d]=%c\n", i, working[0][i]);
		}
		printf("R1終了\n");
		printf("\n");
		//-------------------------------------------------------------------------------------------------

		//文字だけ動かす(R2、R3：文字の配列を文字コードの大きい順に並べ替える)-----------------------------------------------------------------------------------
		c_1 = 0;
		c_2 = 0;
		for (c_1 = 0; c_1 <= 6; c_1++){//文字の入っている配列のみ動かす
			for (c_2 = c_1 + 1; c_2 < 7; c_2++){
				if (working[0][c_2] > working[0][c_1]){//一つ先の配列に入っている文字が1つめより大きければ交換
					s_5 = working[0][c_2];
					working[0][c_2] = working[0][c_1];
					working[0][c_1] = s_5;
				}
				printf("R2[%d]=%c\n", c_2, working[0][c_2]);
				if (c_2 == 6){
					printf("------------------R2\n");
					c_2 = 0;
					//WMの状態が以下と一致していればbreak
					if ('a' == working[0][6] && 'b' == working[0][5] && 'c' == working[0][4] && 'd' == working[0][3] &&
						'e' == working[0][2] && 'f' == working[0][1] && 'g' == working[0][0]){
					}break;
				}
			}
		}
		for (int i = 0; i <= 10; i++){//表示
			printf("R2での最終的な状態(WM)[%d]=%c\n", i, working[0][i]);
		}
		printf("R2終了\n");
		printf("\n");

		//------------------------------------------------------------------------------------------------------

		//記号だけ動かす(R3：記号を文字コードの小さい順に並べ替える)-----------------------------------------------------------------------------------------
		c_1 = 0;
		c_2 = 0;
		for (c_1 = 7; c_1 <= WORD; c_1++){
			for (c_2 = WORD - 1; c_2 > c_1; c_2--){
				if (working[0][c_2 - 1] > working[0][c_2]){
					s_4 = working[0][c_2 - 1];
					working[0][c_2 - 1] = working[0][c_2];
					working[0][c_2] = s_4;
					s_4 = 0;
				}
				printf("R3[%d]=%c(%d)\n", c_2, working[0][c_2], working[0][c_2]);
				if ('*' == working[0][7] && '+' == working[0][8] && '-' == working[0][9] && '/' == working[0][10]){
					break;
					printf("-----------------------\n");
				}
			}
		}
		for (int i = 0; i <= 10; i++){
			printf("R3での最終的な状態(WM)[%d]=%c\n", i, working[0][i]);
		}
		printf("R3終了\n");
		printf("\n");

		printf("------------------------\n");
		//------------------------------------------------------------------------------------------------------------

		//記号をもう一度動かす(R4：*は-と/の間になる)------------------------------------------------------------------------------------
		s_4 = 0;
		for (c_1 = 7; c_1 <= WORD; c_1++){
			if (working[0][c_1] < working[0][c_1 + 1]){//大きさを比べて隣が大きければ入れ替える
				s_4 = working[0][c_1];
				working[0][c_1] = working[0][c_1 + 1];
				working[0][c_1 + 1] = s_4;
				s_4 = 0;
			}
			printf("R4[%d]=%c(%d)\n", c_1, working[0][c_1], working[0][c_1]);

			if ('+' == working[0][7] && '-' == working[0][8] && '*' == working[0][9] && '/' == working[0][10]){//ルール5
				break;
			}
		}
		for (int i = 0; i <= 10; i++){
			printf("R4での最終的な状態(WM)[%d]=%c\n", i, working[0][i]);
		}
		printf("R4終了\n");
		printf("\n");
		printf("------------------------\n");
		//-----------------------------------------------------------------------------------------------------------

	
	//ルール適用後の結果------------------------------------------------------------------------------------------
		while (w < WORD){
			printf("終了時のWM[%d]=%c\n", w, working[0][w]);
			w++;
		}
    //----------------------------------------------------------------------------------------------------------
	}//終了



	


