#include<stdio.h>
int M = 0;////////////////////M=マンハッタン距離の総和////////////
int MM = 0; //////////////////MM＝マンハッタン距離の一つの数////////////
int s[9] = { 8, 1, 5, 2, 0, 4, 6, 3, 7 };//初期状態の配列s

/////MHT=マンハッタンの処理//////
void MHT(){
	//////////////////////マンハッタン距離///////////////////
	//M1//
	M = 0;
	MM = 0;
	if (s[0] == 1){
		MM = 0;
	}
	if (s[1] == 1 || s[3] == 1){
		MM = 1;
	}
	if (s[2] == 1 || s[4] == 1 || s[6] == 1){
		MM = 2;
	}
	else if (s[5] == 1 || s[7] == 1){
		MM = 3;
	}
	else if (s[8] == 1){
		MM = 4;
	}
	M = M + MM;


	//M2//
	if (s[1] == 2){
		MM = 0;
	}
	if (s[0] == 2 || s[2] == 2 || s[4] == 2){
		MM = 1;
	}

	if (s[3] == 2 || s[5] == 2 || s[7] == 2){
		MM = 2;
	}

	if (s[6] == 2 || s[8] == 2){
		MM = 3;
	}
	M = M + MM;


	//M3//
	if (s[2] == 3){
		MM = 0;
	}
	if (s[1] == 3 || s[5] == 3){
		MM = 1;
	}
	if (s[0] == 3 || s[4] == 3 || s[8] == 3){
		MM = 2;
	}
	if (s[3] == 3 || s[7] == 3){
		MM = 3;
	}
	if (s[6] == 3){
		MM = 4;
	}
	M = M + MM;


	//M4//
	if (s[3] == 4){
		MM = 0;
	}
	if (s[0] == 4 || s[4] == 4 || s[6] == 4){
		MM = 1;
	}

	if (s[1] == 4 || s[5] == 4 || s[7] == 4){
		MM = 2;
	}
	if (s[2] == 4 || s[8] == 4){
		MM = 3;
	}
	M = M + MM;


	//M5//
	if (s[4] == 5){
		MM = 0;
	}
	if (s[1] == 5 || s[3] == 5 || s[5] == 5 || s[7] == 5){
		MM = 1;
	}
	if (s[0] == 5 || s[2] == 5 || s[6] == 5 || s[8] == 5){
		MM = 2;
	}
	M = M + MM;


	//M6//
	if (s[5] == 6){
		MM = 0;
	}
	if (s[2] == 6 || s[4] == 6 || s[8] == 6){
		MM = 1;
	}
	if (s[1] == 6 || s[3] == 6 || s[7] == 6){
		MM = 2;
	}
	if (s[0] == 6 || s[6] == 6){
		MM = 3;
	}
	M = M + MM;

	//M7//
	if (s[6] == 7){
		MM = 0;
	}
	if (s[3] == 7 || s[7] == 7){
		MM = 1;
	}
	if (s[0] == 7 || s[4] == 7 || s[8] == 7){
		MM = 2;
	}
	if (s[1] == 7 || s[5] == 7){
		MM = 3;
	}
	if (s[2] == 7){
		MM = 4;
	}
	M = M + MM;

	//M8//
	if (s[7] == 8){
		MM = 0;
	}
	if (s[4] == 8 || s[6] == 8 || s[8] == 8){
		MM = 1;
	}
	if (s[1] == 8 || s[3] == 8 || s[5] == 8){
		MM = 2;
	}
	if (s[0] == 8 || s[2] == 8){
		MM = 3;
	}
	M = M + MM;
	//////////////////////完了//////////////////
	printf("マンハッタン距離の総和はM=%dです。\n", M);
}

int main()
{
	int w = 0;//////////whileのループのための変数//////
	int i;////////forに使うi///////////
	int k[5];///////////////////k1,k2,k3,k4,k5=配列を入れ替えるときの借入////////////////
	int hikaku[5];

	//ゴール状態の配列aを生成（Bを0と置き換えている）
	int a[9] = { 1, 2, 3, 4, 5, 6, 7, 8, 0 };
	///////////////////kk~=配列を入れ替えるときの借入。///////////////////////
	int kk0[9] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };
	int kk1[9] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };
	int kk2[9] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };
	int kk3[9] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };
	int kk4[9] = { 0, 0, 0, 0, 0, 0, 0, 0, 0 };

	//配列の表示
	printf("ステップ0\n配列の状態\n");
	////////////////////////配列の表示。3*3を疑似的に表現。/////////////////
	for (i = 0; i < 9; i++){
		printf("[%d] ", s[i]);
		if (i == 2 || i == 5 || i == 9){
			printf("\n");
		}
	}

	///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
	printf("\nゴール状態\n");
	for (i = 0; i < 9; i++){
		printf("[%d] ", a[i]);
		if (i == 2 || i == 5 || i == 9){
			printf("\n");
		}
	}
	printf("\n");
	
	MHT();

	////////////////////無限ループの開始//////////////
	while(w==0) {///////////////////無限ループ開始したい場合最初を0以外にしてw!=0にする
		w = 0;
		w++;
		printf("ステップ%d\n", w);
		/////////////////////////次のステップ。まずマス目を上下左右に動かすパターンを出し、マンハッタンも適用///////////////
		if (s[0] == 0){
			k[0] = s[1];//////////////0とその右を入れ替えるために、0の右の数をk1に記憶
			k[1] = s[3];//////////////0とその下を入れ替えるために、0の下の数をk2に記憶
			for (i = 0; i < 9; i++){
				kk0[i] = s[i];////////////kk0配列に前の配列をいれる/////////
				kk1[i] = s[i];////////////kk1配列に前の配列をいれる/////////
			}
			////////////////配列の入れ替え///////////
			kk0[1] = 0;
			kk1[3] = 0;
			kk0[0] = k[0];
			kk1[0] = k[1];
			/////////////完了。kk0が0が右にいったときの行列、kk1が０がしたに行ったときの配列///////////////
			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk0[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}

			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////////kk1のマンハッタン///////////
			MHT();
			hikaku[0] = M;

			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk1[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////kk2のマンハッタン///////////////
			MHT();
			hikaku[1] = M;
			///////////////////マンハッタンの比較。それが少ない方をsの配列に代入//////////////
			if (hikaku[0] < hikaku[1]){
				for (i = 0; i < 9; i++){
					s[i] = kk0[i];
				}
			}
			if (hikaku[1] < hikaku[0]){
				for (i = 0; i < 9; i++){
					s[i] = kk1[i];
				}
			}
			printf("マンハッタン距離が最少の数が複数検知されました。\n横松の腕が貧弱なのでその中から下→右→左→上の優先順で選びます\n");
			if (hikaku[0] <= hikaku[1]){
				for (i = 0; i < 9; i++){
					s[i] = kk0[i];
				}
			}
			if (hikaku[1] <= hikaku[0]){
				for (i = 0; i < 9; i++){
					s[i] = kk1[i];
				}
			}
			printf("次のステップに移行します\n");
		}
		if (s[1] == 0){

		}
		if (s[2] == 0){

		}
		if (s[3] == 0){

		}
		if (s[4] == 0){
			//////////////////////真ん中の0が上下左右に動くときの処理とマンハッタン処理///////////
			//k[0]に交換するs[1]の数（上との入れ替え）をいれる////
			k[0] = s[1];
			//k[1]に交換するs[3]の数（左との入れ替え）をいれる////
			k[1] = s[3];
			//k[2]に交換するs[5]の数（右との入れ替え）をいれる////
			k[2] = s[5];
			//k[3]に交換するs[7]の数（下との入れ替え）をいれる////
			k[3] = s[7];
		
			for (i = 0; i < 9; i++){
				kk0[i] = s[i];////////////kk0配列に前の配列をいれる/////////
				kk1[i] = s[i];////////////kk1配列に前の配列をいれる/////////
				kk2[i] = s[i];////////////kk2配列に前の配列をいれる/////////
				kk3[i] = s[i];////////////kk3配列に前の配列をいれる/////////
			}
			//////////////////配列の入れ替え//////////////
			kk0[1] = 0;
			kk1[3] = 0;
			kk2[5] = 0;
			kk3[7] = 0;
			kk0[4] = k[0];
			kk1[4] = k[1];
			kk2[4] = k[2];
			kk3[4] = k[3];
			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk0[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}

			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////////kk0のマンハッタン///////////
			for (i = 0; i < 9; i++){
				s[i] = kk0[i];
			}
			MHT();
			hikaku[0] = M;

			//////////////////////////////////////////////////////kk1
			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk1[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////////kk1のマンハッタン///////////
			for (i = 0; i < 9; i++){
				s[i] = kk1[i];
			}
			MHT();
			hikaku[1] = M;

			//////////////////////////////////////////////////////kk2
			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk2[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////////kk2のマンハッタン///////////
			for (i = 0; i < 9; i++){
				s[i] = kk2[i];
			}
			MHT();
			hikaku[2] = M;

			//////////////////////////////////////////////////////kk3
			//配列の表示
			for (i = 0; i < 9; i++){
				printf("[%d] ", kk3[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			///////////////////////ゴール状態の表示。3*3を疑似的に表現。///////////////
			printf("\nゴール状態\n");
			for (i = 0; i < 9; i++){
				printf("[%d] ", a[i]);
				if (i == 2 || i == 5 || i == 9){
					printf("\n");
				}
			}
			printf("\n");
			//////////////////////kk3のマンハッタン///////////
			for (i = 0; i < 9; i++){
				s[i] = kk3[i];
			}
			MHT();
			hikaku[3] = M;

			/////////////////配列を入れ替える比較///////////////////////
			if (hikaku[0] < hikaku[1] && hikaku[0] < hikaku[2]&&hikaku[0] < hikaku[3]){
				for (i = 0; i < 9; i++){
					s[i] = kk0[i];
				}
			}
			if (hikaku[1] < hikaku[0] && hikaku[1] < hikaku[2] && hikaku[1] < hikaku[3]){
				for (i = 0; i < 9; i++){
					s[i] = kk1[i];
				}
			}
			if (hikaku[2] < hikaku[1] && hikaku[2] < hikaku[0] && hikaku[2] < hikaku[3]){
				for (i = 0; i < 9; i++){
					s[i] = kk2[i];
				}
			}
			if (hikaku[3] < hikaku[1] && hikaku[3] < hikaku[2] && hikaku[3] < hikaku[0]){
				for (i = 0; i < 9; i++){
					s[i] = kk3[i];
				}
			}
			else{
				printf("マンハッタン距離が最少の数が複数検知されました。\n横松の腕が貧弱なのでその中から下→右→左→上の優先順で選びます\n");
				if (hikaku[0] <= hikaku[1] && hikaku[0] <= hikaku[2] && hikaku[0] <= hikaku[3]){
					for (i = 0; i < 9; i++){
						s[i] = kk0[i];
					}
				}
				if (hikaku[1] <= hikaku[0] && hikaku[1] <= hikaku[2] && hikaku[1] <= hikaku[3]){
					for (i = 0; i < 9; i++){
						s[i] = kk1[i];
					}
				}
				if (hikaku[2] <= hikaku[1] && hikaku[2] <= hikaku[0] && hikaku[2] <= hikaku[3]){
					for (i = 0; i < 9; i++){
						s[i] = kk2[i];
					}
				}
				if (hikaku[3] <= hikaku[1] && hikaku[3] <= hikaku[2] && hikaku[3] <= hikaku[0]){
					for (i = 0; i < 9; i++){
						s[i] = kk3[i];
					}
				}
			}
			printf("次のステップに移行します\n\n\n");
		}
		if (s[5] == 0){

		}
		if (s[6] == 0){

		}
		if (s[7] == 0){

		}
		if (s[8] == 0){

		}
		if (s[9] == 0){

		}
		////////////while抜け出し処理///////////
		if (s[0] == a[0] && s[1] == a[1] && s[2] == a[2] && s[3] == a[3] && s[4] == a[4] && s[5] == a[5] && s[6] == a[6] && s[7] == a[7] && s[8] == a[8] && s[9] == a[9]){
			printf("完了しました。終了します\n");
			break;
		}
	}

}